export const ExtensionsWelcome = () => {
  return (
    <section className='braidswelcome'>
      <div className='braidswelcome__text'>
        <span className='braidswelcome__span'>ЗА МЕН</span>
        <h2 className='braidswelcome__label'>Здравейте скъпи фукли!</h2>
        <p className='braidswelcome__paragraph'>
          Аз съм Грета Филева, професионален гримьор от град Велико Търново.
          Страстта ми към гримирането се появи още в ранна детска възраст и
          продължава да се разраства до днес. В продължение на 7 години гримирам
          от домът ми приятелки и клиентки, целеустремена съм да превърна хобито
          ми в професия и тази година реших да се реализирам професионално в
          "Art studio Fukla". Сертифицирала съм "Базово обучение" по грим в
          курса на Гергана Данева и тепърва предстоят безброй класове и мастър
          класове. За мен гримът не е само маска и толкова мода, то е изкуството
          да подчертаем женската красота и да изявим нейната
          индивидуалност.Всеки гримьор се превръща в художник и се потапя в
          света на изкуството което завършва това, което не е донаправила
          природара.
        </p>
      </div>
    </section>
  );
};
