import { useState } from 'react';
import { DesktopCard } from '../../common/DesktopCardWelcome';
import { DesktopCardSplit } from '../../common/DesktopCardWelcome';
import { MobileCard } from '../../common/MobileCardWelcome';
export const BraidsWelcome = () => {
  const [isExpanded, setIsExpanded] = useState(false);
  const [isExpanded2, setIsExpanded2] = useState(false);
  const [isExpanded3, setIsExpanded3] = useState(false);
  return (
    <>
      <div className='flex flex-col items-center justify-center w-full'>
        {/* MARK: Mobile LAYOUT */}
        <div className='flex flex-col w-full gap-4 p-12 sm:hidden'>
          {/* Mobile Card 1 */}
          <MobileCard
            isExpanded={true}
            bgClass='bg-dark-gradient'
            textClass='text-white'
            titleClass='text-white'
            title='Класическа Плитка'
            idName='take-look'
            content='Плитките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност. С тях печелите време за важните неща, като едновременно постигате мечтаната визия и дълга коса. Те безпроблемно преминават от ежедневна небрежност към подчертана елегантност, допълвайки и най-официалния тоалет. Плитките внасят блясък в очите ви, цвят в косите и подчертават вашата естествена усмивка.'
            imageUrl='images/braids/braidsSwiper4.webp'
          />
          {/* Mobile Card 2 */}
          <MobileCard
            bgClass='bg-dark-gradient'
            textClass='text-white'
            titleClass='text-white'
            title='Боксьорските плитки'
            content='Боксьорските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор за активни хора и любители на съвременния стил. Те съчетават спортен дух с елегантност и са подходящи както за ежедневие, така и за специални събития. На изображението са показани две боксьорски плитки, които започват от корените на косата и са сплетени стегнато по дължината на главата. Това е визия, която комбинира практичност и модерен стил, подчертавайки структурата на косата и симетрията.'
            imageUrl='images/braids/braidsSwiper4.webp'
          />
          {/* Mobile Card 3 */}
          <MobileCard
            bgClass='bg-dark-pink-gradient'
            textClass='text-white'
            titleClass='text-white'
            title='Опашка от пълзящи плитки'
            content='Плитките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност. С тях печелите време за важните неща, като едновременно постигате мечтаната визия и дълга коса. Те безпроблемно преминават от ежедневна небрежност към подчертана елегантност, допълвайки и най-официалния тоалет. Плитките внасят блясък в очите ви, цвят в косите и подчертават вашата естествена усмивка.'
            imageUrl='images/braids/braidsSwiper4.webp'
          />
          {/* Mobile Card 4 */}
          <MobileCard
            bgClass='bg-dark-pink-gradient'
            textClass='text-white'
            titleClass='text-white'
            title='Къдрици'
            content='Плитките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност. С тях печелите време за важните неща, като едновременно постигате мечтаната визия и дълга коса. Те безпроблемно преминават от ежедневна небрежност към подчертана елегантност, допълвайки и най-официалния тоалет. Плитките внасят блясък в очите ви, цвят в косите и подчертават вашата естествена усмивка.'
            imageUrl='images/braids/braidsSwiper4.webp'
          />
          {/* Mobile Card 5 */}
          <MobileCard
            bgClass='bg-dark-pink-gradient'
            textClass='text-white'
            titleClass='text-white'
            title='Туистъри'
            content='Плитките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност. С тях печелите време за важните неща, като едновременно постигате мечтаната визия и дълга коса. Те безпроблемно преминават от ежедневна небрежност към подчертана елегантност, допълвайки и най-официалния тоалет. Плитките внасят блясък в очите ви, цвят в косите и подчертават вашата естествена усмивка.'
            imageUrl='images/braids/braidsSwiper4.webp'
          />
          {/* Mobile Card 6 */}
          <MobileCard
            bgClass='bg-pink-gradient'
            textClass='text-zinc-800'
            titleClass='text-zinc-800'
            title='Африканска Плитка'
            content='Плитките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност. С тях печелите време за важните неща, като едновременно постигате мечтаната визия и дълга коса. Те безпроблемно преминават от ежедневна небрежност към подчертана елегантност, допълвайки и най-официалния тоалет. Плитките внасят блясък в очите ви, цвят в косите и подчертават вашата естествена усмивка.'
            imageUrl='images/braids/braidsSwiper4.webp'
          />
          {/* Mobile Card 7 */}
          <MobileCard
            bgClass='bg-pink-gradient'
            textClass='text-zinc-800'
            titleClass='text-zinc-800'
            title='По-ваше Желание'
            content='Плитките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност. С тях печелите време за важните неща, като едновременно постигате мечтаната визия и дълга коса. Те безпроблемно преминават от ежедневна небрежност към подчертана елегантност, допълвайки и най-официалния тоалет. Плитките внасят блясък в очите ви, цвят в косите и подчертават вашата естествена усмивка.'
            imageUrl='images/braids/braidsSwiper4.webp'
          />
        </div>

        {/* MARK: Desktop LAYOUT */}
        {/* First Desktop Card 3/7*/}
        <DesktopCard
          title='Класическа Плитка'
          content='Плитките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност...'
          imageUrl='images/braids/braidsSwiper4.webp'
          bgClass='bg-dark-gradient'
          textColorClass='text-white'
          buttonClass='mt-4 p-2 text-sm sm:text-lg site-button'
          initialImagePosition='right'
          idName='take-a-look-desktop'
          previewLines={3}
          isExpanded={isExpanded}
          setIsExpanded={setIsExpanded}
          maxExpandedHeight='150px' //
        />

        {/* First Split Desktop Card */}
        <DesktopCardSplit
          leftTitle='Боксьорски плитки'
          leftContent='Боксьорските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор... орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор..'
          leftImageUrl='images/braids/braidsSwiper4.webp'
          rightTitle='Опашка от пълзящи плитки'
          rightContent='Плитките не са просто практично решение за премахване на косата от лицето ви... ксьорските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор... орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орскит ксьорските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор... орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орскит'
          rightImageUrl='images/braids/braidsSwiper4.webp'
          leftBgClass='bg-dark-gradient'
          rightBgClass='bg-dark-gradient'
          leftTextColorClass='text-white'
          rightTextColorClass='text-white'
          previewLines={3}
          isExpanded={isExpanded}
          maxExpandedHeight='300px' // Adjust as needed
        />
        {/* 6/7 Elements */}
        <DesktopCard
          title='Класическа Плитка'
          content='Плитките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност...'
          imageUrl='images/braids/braidsSwiper4.webp'
          bgClass='bg-dark-pink-gradient'
          textColorClass='text-white'
          buttonClass='mt-4 p-2 text-sm sm:text-lg site-button'
          initialImagePosition='right'
          initialTextPosition='justify-start'
          idName='second-desktop-card'
          previewLines={3}
          isExpanded={isExpanded2}
          setIsExpanded={setIsExpanded2}
          maxExpandedHeight='200px' //
        />

        {/* First Split Desktop Card */}
        <DesktopCardSplit
          leftTitle='Боксьорски плитки'
          leftContent='Боксьорските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор... орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор..'
          leftImageUrl='images/braids/braidsSwiper4.webp'
          rightTitle='Опашка от пълзящи плитки'
          rightContent='Плитките не са просто практично решение за премахване на косата от лицето ви... ксьорските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор... орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орскит ксьорските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор... орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орските плитки са модерна и функционална прическа, която бързо се превърна в предпочитан избор.. орскит'
          rightImageUrl='images/braids/braidsSwiper4.webp'
          leftBgClass='bg-dark-pink-gradient'
          rightBgClass='bg-dark-pink-gradient'
          leftTextColorClass='text-white'
          rightTextColorClass='text-white'
          previewLines={3}
          isExpanded={isExpanded2}
          maxExpandedHeight='300px' // Adjust as needed
        />
        {/* 7/7 Elements  */}
        <DesktopCard
          title='Kuraqnko'
          content='Плитките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност... литките не са просто практично решение за премахване на косата от лицето ви – те са начин да изразите стил и увереност...'
          imageUrl='images/braids/braidsSwiper4.webp'
          bgClass='bg-pink-gradient'
          textColorClass='text-zinc-800'
          buttonClass='mt-4 p-2 text-sm sm:text-lg site-button !text-zinc-800 hover:!text-white !border-zinc-800 hover:!border-white'
          initialImagePosition='right'
          initialTextPosition='justify-start'
          idName='second-desktop-card'
          previewLines={3}
          isExpanded={isExpanded3}
          setIsExpanded={setIsExpanded3}
          maxExpandedHeight='200px' //
        />
      </div>
    </>
  );
};
