export const NailsWelcome = () => {
  return (
    <section className='braidswelcome' id='nails-welcome'>
      <div className='braidswelcome__text'>
        <span className='braidswelcome__span'>ЗА МЕН</span>
        <h2 className='braidswelcome__label'>Здравейте скъпи фукли!</h2>
        <p className='braidswelcome__paragraph'>
          Нека Ви се представя с няколко думи-казвам се Катя Костадинова и съм
          завършила икономика във Великотърновския университет "Св.св.Кирил и
          Методий".Но още от малка красивите нокти бяха мое хоби и мечта.В мен
          се зароди желанието да допринеса за това жените да се сдобият с
          красиви нокти и изящни ръце.След курс на обучение през 2010 г.започнах
          моята практика и работа в салони за красота в Атина,Гърция. Там реално
          придобих умения и натрувах опит в продължение на 10 години. След
          обмисляне реших да се върна в моята Родина и заедно с други млади хора
          да творя и градим заедно в България.
        </p>
      </div>
    </section>
  );
};
